7767517
23 25
Input            data             0 1 data 0=72 1=72 2=3
Convolution      conv1            1 1 data conv1 0=8 1=3 2=1 3=1 4=1 5=1 6=216
ReLU             conv1/relu       1 1 conv1 conv1_conv1/relu
Pooling          pool1            1 1 conv1_conv1/relu pool1 0=0 1=3 2=2 3=0 4=0
Convolution      conv2            1 1 pool1 conv2 0=12 1=3 2=1 3=1 4=1 5=1 6=864
ReLU             conv2/relu       1 1 conv2 conv2_conv2/relu
Pooling          pool2            1 1 conv2_conv2/relu pool2 0=0 1=3 2=2 3=0 4=0
Convolution      conv3            1 1 pool2 conv3 0=24 1=3 2=1 3=1 4=1 5=1 6=2592
ReLU             conv3/relu       1 1 conv3 conv3_conv3/relu
Pooling          pool3            1 1 conv3_conv3/relu pool3 0=0 1=3 2=2 3=0 4=0
Convolution      conv4            1 1 pool3 conv4 0=48 1=3 2=1 3=1 4=1 5=1 6=10368
ReLU             conv4/relu       1 1 conv4 conv4_conv4/relu
Pooling          pool4            1 1 conv4_conv4/relu pool4 0=0 1=3 2=2 3=0 4=0
Convolution      conv5            1 1 pool4 conv5 0=96 1=3 2=1 3=1 4=1 5=1 6=41472
ReLU             conv5/relu       1 1 conv5 conv5_conv5/relu
Pooling          pool5            1 1 conv5_conv5/relu pool5 0=0 1=3 2=2 3=0 4=0
InnerProduct     fc6              1 1 pool5 fc6 0=128 1=1 2=49152
ReLU             fc6/relu         1 1 fc6 fc6_fc6/relu
Split            splitncnn_0      1 3 fc6_fc6/relu fc6_fc6/relu_splitncnn_0 fc6_fc6/relu_splitncnn_1 fc6_fc6/relu_splitncnn_2
InnerProduct     fc7              1 1 fc6_fc6/relu_splitncnn_2 fc7 0=2 1=1 2=256
Softmax          cls_prob         1 1 fc7 cls_prob 0=0 1=1
InnerProduct     bbox_reg         1 1 fc6_fc6/relu_splitncnn_1 bbox_reg 0=3 1=1 2=384
InnerProduct     rotate_reg       1 1 fc6_fc6/relu_splitncnn_0 rotate_reg 0=1 1=1 2=128
